
&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	Дата = ТекущаяДата();  
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТипТранзакции = ТекущийОбъект.Тип;
	ОбъектТекущийСчет  = ТекущийОбъект.Счет.ПолучитьОбъект();
	БалансСчета = ОбъектТекущийСчет.Сумма;
	СуммаТранзакции  = ТекущийОбъект.Сумма;
	
	БалансСчета = БалансСчета + СуммаТранзакции;
	ОбъектТекущийСчет.Сумма = БалансСчета;
	ОбъектТекущийСчет.Записать();  
	
КонецПроцедуры // ПередЗаписьюНаСервере()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ВладелецТранзакцииСумм = ПараметрыСеанса.ИмяТекущегоПользователя;
КонецПроцедуры
