&НаКлиенте
Процедура Перевод(Команда)
	Форма = ПолучитьФорму("ОбщаяФорма.Переводы");
	Форма.Открыть();
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьСуммуСчетов();	
КонецПроцедуры 

&НаСервере
Функция ПолучитьСуммуСчетов();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(КошелекШамиля.Сумма) КАК Сумма
	               |ИЗ
	               |	Справочник.КошелекШамиля КАК КошелекШамиля";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		ОбщаяСумма = ВыборкаЗапроса.Сумма;
	КонецЦикла	
КонецФункции
