
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Дата = ТекущаяДата();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТипТранзакции = ТекущийОбъект.Тип;
	ОбъектТекущийСчет  = ТекущийОбъект.Счет.ПолучитьОбъект();
	БалансСчета = ОбъектТекущийСчет.Сумма;
	СуммаТранзакции  = ТекущийОбъект.Сумма;
	
	Если БалансСчета < СуммаТранзакции Тогда
		Сообщить("Недостаточно средств, проверьте ваш счет");
	Иначе
		БалансСчета = БалансСчета - СуммаТранзакции;
		ОбъектТекущийСчет.Сумма = БалансСчета;
		ОбъектТекущийСчет.Записать();
	КонецЕсли
КонецПроцедуры 

&НаКлиенте
Процедура ТипОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)  
	ТипДругомуЛицу = ПредопределенноеЗначение("Перечисление.ТипыПереводов.ДругомуЛицу");
	ТипДругое = ПредопределенноеЗначение("Перечисление.ТипыПереводов.Другое");	
	Если Объект.Тип = ТипДругомуЛицу Тогда
		ЭтаФорма.Элементы.НомерТелефона.Видимость = True;
	Иначе 
		ЭтаФорма.Элементы.НомерТелефона.Видимость = False;
	КонецЕсли;
	
	Если Объект.Тип = ТипДругое Тогда
		ЭтаФорма.Элементы.Указать.Видимость = True;
	Иначе 
		ЭтаФорма.Элементы.Указать.Видимость = False;
	КонецЕсли;
КонецПроцедуры


