&НаСервере
Функция ПосчитатьСуммуСчетов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(Кошелек.Сумма) КАК Сумма
	               |ИЗ
	               |	Справочник.Кошелек КАК Кошелек
	               |ГДЕ
	               |	Кошелек.ВладелецКошелька = &ВладелецКошелька";
	Запрос.УстановитьПараметр("ВладелецКошелька",ПараметрыСеанса.ИмяТекущегоПользователя);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		СуммаВсехСчетов = ВыборкаЗапроса.Сумма;		
	КонецЦикла;
	
	Возврат СуммаВсехСчетов
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПосчитатьСуммуСчетов();
	ПосчитатьКоличествоСчетов();
	ПолучитьСуммуРасходов();
	ПолучитьСуммуДоходов();
	ПолучитьКоличествоРасходов();
	ПолучитьКоличествоДоходов();
КонецПроцедуры

&НаСервере
Функция ПосчитатьКоличествоСчетов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Кошелек.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.Кошелек КАК Кошелек
	               |ГДЕ
	               |	Кошелек.ВладелецКошелька = &ВладелецКошелька";
	Запрос.УстановитьПараметр("ВладелецКошелька",ПараметрыСеанса.ИмяТекущегоПользователя);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	КолВоСчетов = 0;  
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		КолВоСчетов = КолВоСчетов + 1;	
	КонецЦикла;
	КоличествоСчетов = КолВоСчетов;
	
	Возврат КолВоСчетов
КонецФункции

&НаСервере
Функция ПолучитьКоличествоРасходов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТранзакцииВыч.Сумма КАК Сумма
	               |ИЗ
	               |	Документ.ТранзакцииВыч КАК ТранзакцииВыч
	               |ГДЕ
	               |	ТранзакцииВыч.ВладелецТранзакцииВыч = &ВладелецТранзакцииВыч";
	Запрос.УстановитьПараметр("ВладелецТранзакцииВыч",ПараметрыСеанса.ИмяТекущегоПользователя);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	КолВоТранзакцийВыч = 0;
	Пока ВыборкаЗапроса.Следующий() Цикл
		КолВоТранзакцийВыч = КолВоТранзакцийВыч + 1;
	КонецЦикла;
	КоличествоРасходов = КолВоТранзакцийВыч;
	
	Возврат КоличествоРасходов
КонецФункции

&НаСервере
Функция ПолучитьКоличествоДоходов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТранзакцииСумм.Сумма КАК Сумма
	               |ИЗ
	               |	Документ.ТранзакцииСумм КАК ТранзакцииСумм
	               |ГДЕ
	               |	ТранзакцииСумм.ВладелецТранзакцииСумм = &ВладелецТранзакцииСумм";   
	Запрос.УстановитьПараметр("ВладелецТранзакцииСумм",ПараметрыСеанса.ИмяТекущегоПользователя);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	КолВоТранзакцийСумм = 0;
	Пока ВыборкаЗапроса.Следующий() Цикл
    	КолВоТранзакцийСумм = КолВоТранзакцийСумм + 1;
	КонецЦикла;
	КоличествоДоходов = КолВоТранзакцийСумм;
	
	Возврат КолВоТранзакцийСумм
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	ПосчитатьСуммуСчетов();
	ПосчитатьКоличествоСчетов();
	ПолучитьСуммуРасходов();
	ПолучитьСуммуДоходов();
	ПолучитьКоличествоРасходов();
	ПолучитьКоличествоДоходов();
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуРасходов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ТранзакцииВыч.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.ТранзакцииВыч КАК ТранзакцииВыч
	               |ГДЕ
	               |	ТранзакцииВыч.ВладелецТранзакцииВыч = &ВладелецТранзакцииВыч";
	Запрос.УстановитьПараметр("ВладелецТранзакцииВыч",ПараметрыСеанса.ИмяТекущегоПользователя);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		СуммаРасходов = ВыборкаЗапроса.Сумма;	
	КонецЦикла;
	
	Возврат СуммаРасходов
КонецФункции

&НаСервере
Функция ПолучитьСуммуДоходов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ТранзакцииСумм.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.ТранзакцииСумм КАК ТранзакцииСумм
	               |ГДЕ
	               |	ТранзакцииСумм.ВладелецТранзакцииСумм = &ВладелецТранзакцииСумм";
	Запрос.УстановитьПараметр("ВладелецТранзакцииСумм",ПараметрыСеанса.ИмяТекущегоПользователя);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		СуммаДоходов = ВыборкаЗапроса.Сумма;	
	КонецЦикла;
	
	Возврат СуммаДоходов
КонецФункции	
