Функция ПолучитьВсеТранзакцииДоходов()
	Массив = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТранзакцииСумм.Счет КАК Счет,
	               |	ТранзакцииСумм.Сумма КАК Сумма,
	               |	ТранзакцииСумм.Описание КАК Описание
	               |ИЗ
	               |	Документ.ТранзакцииСумм КАК ТранзакцииСумм";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Данные = Новый Структура;
		Данные.Вставить("nameAccount", Строка(ВыборкаЗапроса.Счет));
		Данные.Вставить("sum", ВыборкаЗапроса.Сумма);
		Данные.Вставить("description", Строка(ВыборкаЗапроса.Описание));
		Массив.Добавить(Данные);
	КонецЦикла;                                     
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,Массив);
	
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция allTransactionsGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);  
	Ответ.УстановитьТелоИзСтроки(ПолучитьВсеТранзакцииДоходов());
	Возврат Ответ;
КонецФункции

Функция ПолучитьВсеТранзакцииРасходов()
	Массив = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТранзакцииВыч.Счет КАК Счет,
	               |	ТранзакцииВыч.Сумма КАК Сумма,
	               |	ТранзакцииВыч.Описание КАК Описание
	               |ИЗ
	               |	Документ.ТранзакцииВыч КАК ТранзакцииВыч";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Данные = Новый Структура;
		Данные.Вставить("nameAccount", Строка(ВыборкаЗапроса.Счет));
		Данные.Вставить("sum", ВыборкаЗапроса.Сумма);
		Данные.Вставить("description", Строка(ВыборкаЗапроса.Описание));
		Массив.Добавить(Данные);
	КонецЦикла;                                     
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,Массив);
	
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция allTransactionsConsumptionGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);      
	Ответ.УстановитьТелоИзСтроки(ПолучитьВсеТранзакцииРасходов());
	Возврат Ответ;
КонецФункции
