 &НаСервере
Функция ПолучитьОбщуюСумму()
	ОбщаяСумма = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(Кошелек.Сумма) КАК Сумма
	               |ИЗ
	               |	Справочник.Кошелек КАК Кошелек";
	//Запрос.УстановитьПараметр("ВладелецКошелька", ПараметрыСеанса.ИмяТекущегоПользователя);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		ОбщаяСумма = ОбщаяСумма + ВыборкаЗапроса.Сумма;	
	КонецЦикла;                            
	
	Возврат ОбщаяСумма
КонецФункции

&НаКлиенте
Процедура БюджетПриИзменении(Элемент)
	ОбщаяСуммаСчетов = ПолучитьОбщуюСумму();
	Если ЗначениеЗаполнено(Объект.План) и ЗначениеЗаполнено(Объект.Бюджет) Тогда
		Если ОбщаяСуммаСчетов >= Объект.Бюджет Тогда
			Сообщить("Для реализацци плана:" + " " + Объект.План + " " + "Хватает срдеств:" + Символы.ПС + "Остаток:" + " " + Строка((ОбщаяСуммаСчетов - Объект.Бюджет)));	
			//Не сохраняет в реквезит "Результат"
		Иначе
			Сообщить("Для реализацци плана:" + " " + Объект.План + " " + "Не хватает срдеств:" + Символы.ПС + "Необходимо еще:" + " " + СтрЗаменить(Строка((Объект.Бюджет - ОбщаяСуммаСчетов)),"-",""));
		КонецЕсли;	
	КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ВладелецПлана = ПараметрыСеанса.ИмяТекущегоПользователя;
КонецПроцедуры
