//&НаКлиенте
//Процедура ЗаполнитьРезультат();
//	ОбщаяСумма = ПолучитьОбщуюСумму();
//	Если ЗначениеЗаполнено(Объект.План) и ЗначениеЗаполнено(Объект.Бюджет) Тогда
//		Если ОбщаяСумма >= Объект.Бюджет Тогда
//			Результат = "Для реализацци плана:" + " " + Объект.План + " " + "Хватает срдеств:" + Символы.ПС + "Остаток:" + " " + Строка((ОбщаяСумма - Объект.Бюджет));	
//		Иначе
//			Результат = "Для реализацци плана:" + " " + Объект.План + " " + "Не хватает срдеств:" + Символы.ПС + "Необходимо еще:" + " " + СтрЗаменить(Строка((Объект.Бюджет - ОбщаяСумма)),"-","");
//		КонецЕсли;	
//	КонецЕсли
//КонецПроцедуры  

&НаСервере
Функция ПолучитьОбщуюСумму()
	ОбщаяСумма = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(КошелекШамиля.Сумма) КАК Сумма
	               |ИЗ
	               |	Справочник.КошелекШамиля КАК КошелекШамиля";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		ОбщаяСумма = ОбщаяСумма + ВыборкаЗапроса.Сумма;	
	КонецЦикла;                            
	
	Возврат ОбщаяСумма
КонецФункции

&НаКлиенте
Процедура БюджетПриИзменении(Элемент)
	ОбщаяСуммаСчетов = ПолучитьОбщуюСумму();
	Если ЗначениеЗаполнено(Объект.План) и ЗначениеЗаполнено(Объект.Бюджет) Тогда
		Если ОбщаяСуммаСчетов >= Объект.Бюджет Тогда
			Сообщить("Для реализацци плана:" + " " + Объект.План + " " + "Хватает срдеств:" + Символы.ПС + "Остаток:" + " " + Строка((ОбщаяСуммаСчетов - Объект.Бюджет)));	
		Иначе
			Сообщить("Для реализацци плана:" + " " + Объект.План + " " + "Не хватает срдеств:" + Символы.ПС + "Необходимо еще:" + " " + СтрЗаменить(Строка((Объект.Бюджет - ОбщаяСуммаСчетов)),"-",""));
		КонецЕсли;	
	КонецЕсли
КонецПроцедуры
