
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ПодключитьОбработчикОжидания("ПроверкаАктивнойКнопки",0.1,Истина);
КонецПроцедуры 

//&НаКлиенте
//Процедура ПроверкаАктивнойКнопки()
//	АктивнаяКнопка = ЭтаФорма.ТекущийЭлемент;
//	ОбычныйЦвет = Новый Цвет();
//	
//	ЭтаФорма.Элементы.ПосмотретьСчета.ЦветФона = ?(ЭтаФорма.Элементы.ПосмотретьСчета = АктивнаяКнопка, WebЦвета.СветлоЗеленый, ОбычныйЦвет);
//	ЭтаФорма.Элементы.ПосмотретьОтчеты.ЦветФона = ?(ЭтаФорма.Элементы.ПосмотретьОтчеты = АктивнаяКнопка, WebЦвета.СветлоЗеленый, ОбычныйЦвет);
//	
//	ПодключитьОбработчикОжидания("ПроверкаАктивнойКнопки",0.1,Истина);
//КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьСчета(Команда)
	ОткрытьФорму("Справочник.Кошелек.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьОтчеты(Команда)
	ОткрытьФорму("ОбщаяФорма.Отчеты");	
КонецПроцедуры

Функция ПолучитьТипыДоходов();
	Массив = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипыДоходов.Наименование КАК Наименование,
	               |	ТипыДоходов.Код КАК Код
	               |ИЗ
	               |	Справочник.ТипыДоходов КАК ТипыДоходов
	               |ГДЕ
	               |	ТипыДоходов.ВладелецТипаДоходов = &ИмяТекущегоПользователя";
	Запрос.УстановитьПараметр("ИмяТекущегоПользователя", ПараметрыСеанса.ИмяТекущегоПользователя);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Данные = Новый Структура;
		Данные.Вставить("code", ВыборкаЗапроса.Код);
		Данные.Вставить("nameType", Строка(ВыборкаЗапроса.Наименование));
		Массив.Добавить(Данные);
	КонецЦикла;                  
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,Массив);
	ЗаписьJSON.Закрыть();
	
	Возврат ЗаписьJSON
КонецФункции


&НаКлиенте
Процедура ЗапросТипов(Команда)
	Сообщить(ПолучитьТипыДоходов())
КонецПроцедуры
