
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ПодключитьОбработчикОжидания("ПроверкаАктивнойКнопки",0.1,Истина);
КонецПроцедуры 

//&НаКлиенте
//Процедура ПроверкаАктивнойКнопки()
//	АктивнаяКнопка = ЭтаФорма.ТекущийЭлемент;
//	ОбычныйЦвет = Новый Цвет();
//	
//	ЭтаФорма.Элементы.ПосмотретьСчета.ЦветФона = ?(ЭтаФорма.Элементы.ПосмотретьСчета = АктивнаяКнопка, WebЦвета.СветлоЗеленый, ОбычныйЦвет);
//	ЭтаФорма.Элементы.ПосмотретьОтчеты.ЦветФона = ?(ЭтаФорма.Элементы.ПосмотретьОтчеты = АктивнаяКнопка, WebЦвета.СветлоЗеленый, ОбычныйЦвет);
//	
//	ПодключитьОбработчикОжидания("ПроверкаАктивнойКнопки",0.1,Истина);
//КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьСчета(Команда)
	ОткрытьФорму("Справочник.Кошелек.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьОтчеты(Команда)
	ОткрытьФорму("ОбщаяФорма.Отчеты");	
КонецПроцедуры
