
&НаКлиенте
Процедура МеждуСвоими(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Пополнить(Команда)
	Форма = ПолучитьФорму("Документ.ТранзакцииСумм.ФормаСписка");
	Форма.Открыть();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Перевод(Команда)
	Форма = ПолучитьФорму("Документ.ТранзакцииВыч.ФормаСписка");
	Форма.Открыть();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПланированиеБюджета(Команда)
	ОткрытьФорму("Документ.БудушиеПланы.ФормаСписка");
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПланированиеБюджетаа(Команда)
	
КонецПроцедуры
